<template>
  <div class="mask">
    <div class="button-box">
      <button class="left btn" @click="buttonCancel">取消</button>
      <button class="right btn" @click="buttonConfirm">确定</button>
    </div>
    <div class="shade-top"></div>
    <div class="shade-bottom"></div>
    <div class="row">
      <ul class="col-8" @touchstart.stop="initProvinceY" @touchmove.stop="choseProvince"  @touchend.stop="confirmProvince">
        <li v-for="item in province" :class="item.name === provinceChosen ? 'chosen' : ''">{{item.name}}</li>
      </ul>
      <ul class="col-8" @touchstart.stop="initMunicipalityY" @touchmove.stop="choseMunicipality"  @touchend.stop="confirmMunicipality">
        <li v-for="item in municipality" :class="item.name === municipalityChosen ? 'chosen' : ''">{{item.name}}</li>
      </ul>
      <ul class="col-8" @touchstart.stop="initDistrictY" @touchmove.stop="choseDistrict"  @touchend.stop="confirmDistrict">
        <li v-for="item in district" :class="item === districtChosen? 'chosen' : ''">{{item}}</li>
      </ul>
      <div class="sign"></div>
    </div>
  </div>
</template>

<script>
  export default {
    name: "city-address",
    data () {
      return {
        cities: [
          {
            "name": "四川省",
            "city": [
              {
                "name": "成都市",
                "area": [
                  "青羊区",
                  "锦江区",
                  "金牛区",
                  "武侯区",
                  "成华区",
                  "龙泉驿区",
                  "青白江区",
                  "新都区",
                  "温江区",
                  "都江堰市",
                  "彭州市",
                  "邛崃市",
                  "崇州市",
                  "金堂县",
                  "郫县",
                  "新津县",
                  "双流县",
                  "蒲江县",
                  "大邑县"
                ]
              },
              {
                "name": "自贡市",
                "area": [
                  "大安区",
                  "自流井区",
                  "贡井区",
                  "沿滩区",
                  "荣县",
                  "富顺县"
                ]
              },
              {
                "name": "攀枝花市",
                "area": [
                  "仁和区",
                  "米易县",
                  "盐边县",
                  "东区",
                  "西区"
                ]
              },
              {
                "name": "泸州市",
                "area": [
                  "江阳区",
                  "纳溪区",
                  "龙马潭区",
                  "泸县",
                  "合江县",
                  "叙永县",
                  "古蔺县"
                ]
              },
              {
                "name": "德阳市",
                "area": [
                  "旌阳区",
                  "广汉市",
                  "什邡市",
                  "绵竹市",
                  "罗江县",
                  "中江县"
                ]
              },
              {
                "name": "绵阳市",
                "area": [
                  "涪城区",
                  "游仙区",
                  "江油市",
                  "盐亭县",
                  "三台县",
                  "平武县",
                  "安县",
                  "梓潼县",
                  "北川羌族自治县"
                ]
              },
              {
                "name": "广元市",
                "area": [
                  "元坝区",
                  "朝天区",
                  "青川县",
                  "旺苍县",
                  "剑阁县",
                  "苍溪县",
                  "市中区"
                ]
              },
              {
                "name": "遂宁市",
                "area": [
                  "船山区",
                  "安居区",
                  "射洪县",
                  "蓬溪县",
                  "大英县"
                ]
              },
              {
                "name": "内江市",
                "area": [
                  "市中区",
                  "东兴区",
                  "资中县",
                  "隆昌县",
                  "威远县"
                ]
              },
              {
                "name": "乐山市",
                "area": [
                  "市中区",
                  "五通桥区",
                  "沙湾区",
                  "金口河区",
                  "峨眉山市",
                  "夹江县",
                  "井研县",
                  "犍为县",
                  "沐川县",
                  "马边彝族自治县",
                  "峨边彝族自治县"
                ]
              },
              {
                "name": "南充",
                "area": [
                  "顺庆区",
                  "高坪区",
                  "嘉陵区",
                  "阆中市",
                  "营山县",
                  "蓬安县",
                  "仪陇县",
                  "南部县",
                  "西充县"
                ]
              },
              {
                "name": "眉山市",
                "area": [
                  "东坡区",
                  "仁寿县",
                  "彭山县",
                  "洪雅县",
                  "丹棱县",
                  "青神县"
                ]
              },
              {
                "name": "宜宾市",
                "area": [
                  "翠屏区",
                  "宜宾县",
                  "兴文县",
                  "南溪县",
                  "珙县",
                  "长宁县",
                  "高县",
                  "江安县",
                  "筠连县",
                  "屏山县"
                ]
              },
              {
                "name": "广安市",
                "area": [
                  "广安区",
                  "华蓥市",
                  "岳池县",
                  "邻水县",
                  "武胜县"
                ]
              },
              {
                "name": "达州市",
                "area": [
                  "通川区",
                  "万源市",
                  "达县",
                  "渠县",
                  "宣汉县",
                  "开江县",
                  "大竹县"
                ]
              },
              {
                "name": "雅安市",
                "area": [
                  "雨城区",
                  "芦山县",
                  "石棉县",
                  "名山县",
                  "天全县",
                  "荥经县",
                  "宝兴县",
                  "汉源县"
                ]
              },
              {
                "name": "巴中市",
                "area": [
                  "巴州区",
                  "南江县",
                  "平昌县",
                  "通江县"
                ]
              },
              {
                "name": "资阳市",
                "area": [
                  "雁江区",
                  "简阳市",
                  "安岳县",
                  "乐至县"
                ]
              },
              {
                "name": "阿坝藏族羌族自治州",
                "area": [
                  "马尔康县",
                  "九寨沟县",
                  "红原县",
                  "汶川县",
                  "阿坝县",
                  "理县",
                  "若尔盖县",
                  "小金县",
                  "黑水县",
                  "金川县",
                  "松潘县",
                  "壤塘县",
                  "茂县"
                ]
              },
              {
                "name": "甘孜藏族自治州",
                "area": [
                  "康定县",
                  "丹巴县",
                  "炉霍县",
                  "九龙县",
                  "甘孜县",
                  "雅江县",
                  "新龙县",
                  "道孚县",
                  "白玉县",
                  "理塘县",
                  "德格县",
                  "乡城县",
                  "石渠县",
                  "稻城县",
                  "色达县",
                  "巴塘县",
                  "泸定县",
                  "得荣县"
                ]
              },
              {
                "name": "凉山彝族自治州",
                "area": [
                  "西昌市",
                  "美姑县",
                  "昭觉县",
                  "金阳县",
                  "甘洛县",
                  "布拖县",
                  "雷波县",
                  "普格县",
                  "宁南县",
                  "喜德县",
                  "会东县",
                  "越西县",
                  "会理县",
                  "盐源县",
                  "德昌县",
                  "冕宁县",
                  "木里藏族自治县"
                ]
              }
            ]
          },
          {
            "name": "浙江省",
            "city": [
              {
                "name": "杭州市",
                "area": [
                  "拱墅区",
                  "西湖区",
                  "上城区",
                  "下城区",
                  "江干区",
                  "滨江区",
                  "余杭区",
                  "萧山区",
                  "建德市",
                  "富阳市",
                  "临安市",
                  "桐庐县",
                  "淳安县"
                ]
              },
              {
                "name": "宁波市",
                "area": [
                  "海曙区",
                  "江东区",
                  "江北区",
                  "镇海区",
                  "北仑区",
                  "鄞州区",
                  "余姚市",
                  "慈溪市",
                  "奉化市",
                  "宁海县",
                  "象山县"
                ]
              },
              {
                "name": "温州市",
                "area": [
                  "鹿城区",
                  "龙湾区",
                  "瓯海区",
                  "瑞安市",
                  "乐清市",
                  "永嘉县",
                  "洞头县",
                  "平阳县",
                  "苍南县",
                  "文成县",
                  "泰顺县"
                ]
              },
              {
                "name": "嘉兴市",
                "area": [
                  "秀城区",
                  "秀洲区",
                  "海宁市",
                  "平湖市",
                  "桐乡市",
                  "嘉善县",
                  "海盐县"
                ]
              },
              {
                "name": "湖州市",
                "area": [
                  "吴兴区",
                  "南浔区",
                  "长兴县",
                  "德清县",
                  "安吉县"
                ]
              },
              {
                "name": "绍兴市",
                "area": [
                  "越城区",
                  "诸暨市",
                  "上虞市",
                  "嵊州市",
                  "绍兴县",
                  "新昌县"
                ]
              },
              {
                "name": "金华市",
                "area": [
                  "婺城区",
                  "金东区",
                  "兰溪市",
                  "义乌市",
                  "东阳市",
                  "永康市",
                  "武义县",
                  "浦江县",
                  "磐安县"
                ]
              },
              {
                "name": "衢州市",
                "area": [
                  "柯城区",
                  "衢江区",
                  "江山市",
                  "龙游县",
                  "常山县",
                  "开化县"
                ]
              },
              {
                "name": "舟山市",
                "area": [
                  "定海区",
                  "普陀区",
                  "岱山县",
                  "嵊泗县"
                ]
              },
              {
                "name": "台州市",
                "area": [
                  "椒江区",
                  "黄岩区",
                  "路桥区",
                  "临海市",
                  "温岭市",
                  "玉环县",
                  "天台县",
                  "仙居县",
                  "三门县"
                ]
              },
              {
                "name": "丽水市",
                "area": [
                  "莲都区",
                  "龙泉市",
                  "缙云县",
                  "青田县",
                  "云和县",
                  "遂昌县",
                  "松阳县",
                  "庆元县",
                  "景宁畲族自治县"
                ]
              }
            ]
          },
          {
            "name": "福建省",
            "city": [
              {
                "name": "福州市",
                "area": [
                  "鼓楼区",
                  "台江区",
                  "仓山区",
                  "马尾区",
                  "晋安区",
                  "福清市",
                  "长乐市",
                  "闽侯县",
                  "闽清县",
                  "永泰县",
                  "连江县",
                  "罗源县",
                  "平潭县"
                ]
              },
              {
                "name": "厦门市",
                "area": [
                  "思明区",
                  "海沧区",
                  "湖里区",
                  "集美区",
                  "同安区",
                  "翔安区"
                ]
              },
              {
                "name": "莆田市",
                "area": [
                  "城厢区",
                  "涵江区",
                  "荔城区",
                  "秀屿区",
                  "仙游县"
                ]
              },
              {
                "name": "三明市",
                "area": [
                  "梅列区",
                  "三元区",
                  "永安市",
                  "明溪县",
                  "将乐县",
                  "大田县",
                  "宁化县",
                  "建宁县",
                  "沙县",
                  "尤溪县",
                  "清流县",
                  "泰宁县"
                ]
              },
              {
                "name": "泉州市",
                "area": [
                  "鲤城区",
                  "丰泽区",
                  "洛江区",
                  "泉港区",
                  "石狮市",
                  "晋江市",
                  "南安市",
                  "惠安县",
                  "永春县",
                  "安溪县",
                  "德化县",
                  "金门县"
                ]
              },
              {
                "name": "漳州市",
                "area": [
                  "芗城区",
                  "龙文区",
                  "龙海市",
                  "平和县",
                  "南靖县",
                  "诏安县",
                  "漳浦县",
                  "华安县",
                  "东山县",
                  "长泰县",
                  "云霄县"
                ]
              },
              {
                "name": "南平市",
                "area": [
                  "延平区",
                  "建瓯市",
                  "邵武市",
                  "武夷山市",
                  "建阳市",
                  "松溪县",
                  "光泽县",
                  "顺昌县",
                  "浦城县",
                  "政和县"
                ]
              },
              {
                "name": "龙岩市",
                "area": [
                  "新罗区",
                  "漳平市",
                  "长汀县",
                  "武平县",
                  "上杭县",
                  "永定县",
                  "连城县"
                ]
              },
              {
                "name": "宁德市",
                "area": [
                  "蕉城区",
                  "福安市",
                  "福鼎市",
                  "寿宁县",
                  "霞浦县",
                  "柘荣县",
                  "屏南县",
                  "古田县",
                  "周宁县"
                ]
              }
            ]
          },
          {
            "name": "广东省",
            "city": [
              {
                "name": "广州市",
                "area": [
                  "越秀区",
                  "荔湾区",
                  "海珠区",
                  "天河区",
                  "白云区",
                  "黄埔区",
                  "番禺区",
                  "花都区",
                  "南沙区",
                  "萝岗区",
                  "增城市",
                  "从化市"
                ]
              },
              {
                "name": "深圳市",
                "area": [
                  "福田区",
                  "罗湖区",
                  "南山区",
                  "宝安区",
                  "龙岗区",
                  "盐田区"
                ]
              },
              {
                "name": "东莞市",
                "area": [
                  "莞城",
                  "常平",
                  "塘厦",
                  "塘厦",
                  "塘厦"
                ]
              },
              {
                "name": "中山市",
                "area": [
                  "中山"
                ]
              },
              {
                "name": "潮州市",
                "area": [
                  "湘桥区",
                  "潮安县",
                  "饶平县"
                ]
              },
              {
                "name": "揭阳市",
                "area": [
                  "榕城区",
                  "揭东县",
                  "揭西县",
                  "惠来县",
                  "普宁市"
                ]
              },
              {
                "name": "云浮市",
                "area": [
                  "云城区",
                  "新兴县",
                  "郁南县",
                  "云安县",
                  "罗定市"
                ]
              },
              {
                "name": "珠海市",
                "area": [
                  "香洲区",
                  "斗门区",
                  "金湾区"
                ]
              },
              {
                "name": "汕头市",
                "area": [
                  "金平区",
                  "濠江区",
                  "龙湖区",
                  "潮阳区",
                  "潮南区",
                  "澄海区",
                  "南澳县"
                ]
              },
              {
                "name": "韶关市",
                "area": [
                  "浈江区",
                  "武江区",
                  "曲江区",
                  "乐昌市",
                  "南雄市",
                  "始兴县",
                  "仁化县",
                  "翁源县",
                  "新丰县",
                  "乳源瑶族自治县"
                ]
              },
              {
                "name": "佛山市",
                "area": [
                  "禅城区",
                  "南海区",
                  "顺德区",
                  "三水区",
                  "高明区"
                ]
              },
              {
                "name": "江门市",
                "area": [
                  "蓬江区",
                  "江海区",
                  "新会区",
                  "恩平市",
                  "台山市",
                  "开平市",
                  "鹤山市"
                ]
              },
              {
                "name": "湛江市",
                "area": [
                  "赤坎区",
                  "霞山区",
                  "坡头区",
                  "麻章区",
                  "吴川市",
                  "廉江市",
                  "雷州市",
                  "遂溪县",
                  "徐闻县"
                ]
              },
              {
                "name": "茂名市",
                "area": [
                  "茂南区",
                  "茂港区",
                  "化州市",
                  "信宜市",
                  "高州市",
                  "电白县"
                ]
              },
              {
                "name": "肇庆市",
                "area": [
                  "端州区",
                  "鼎湖区",
                  "高要市",
                  "四会市",
                  "广宁县",
                  "怀集县",
                  "封开县",
                  "德庆县"
                ]
              },
              {
                "name": "惠州市",
                "area": [
                  "惠城区",
                  "惠阳区",
                  "博罗县",
                  "惠东县",
                  "龙门县"
                ]
              },
              {
                "name": "梅州市",
                "area": [
                  "梅江区",
                  "兴宁市",
                  "梅县",
                  "大埔县",
                  "丰顺县",
                  "五华县",
                  "平远县",
                  "蕉岭县"
                ]
              },
              {
                "name": "汕尾市",
                "area": [
                  "城区",
                  "陆丰市",
                  "海丰县",
                  "陆河县"
                ]
              },
              {
                "name": "河源市",
                "area": [
                  "源城区",
                  "紫金县",
                  "龙川县",
                  "连平县",
                  "和平县",
                  "东源县"
                ]
              },
              {
                "name": "阳江市",
                "area": [
                  "江城区",
                  "阳春市",
                  "阳西县",
                  "阳东县"
                ]
              },
              {
                "name": "清远市",
                "area": [
                  "清城区",
                  "英德市",
                  "连州市",
                  "佛冈县",
                  "阳山县",
                  "清新县",
                  "连山壮族瑶族自治县",
                  "连南瑶族自治县"
                ]
              }
            ]
          },
          {
            "name": "贵州省",
            "city": [
              {
                "name": "贵阳市",
                "area": [
                  "南明区",
                  "云岩区",
                  "花溪区",
                  "乌当区",
                  "白云区",
                  "小河区",
                  "清镇市",
                  "开阳县",
                  "修文县",
                  "息烽县"
                ]
              },
              {
                "name": "六盘水市",
                "area": [
                  "钟山区",
                  "水城县",
                  "盘县",
                  "六枝特区"
                ]
              },
              {
                "name": "遵义市",
                "area": [
                  "红花岗区",
                  "汇川区",
                  "赤水市",
                  "仁怀市",
                  "遵义县",
                  "绥阳县",
                  "桐梓县",
                  "习水县",
                  "凤冈县",
                  "正安县",
                  "余庆县",
                  "湄潭县",
                  "道真仡佬族苗族自治县",
                  "务川仡佬族苗族自治县"
                ]
              },
              {
                "name": "安顺市",
                "area": [
                  "西秀区",
                  "普定县",
                  "平坝县",
                  "镇宁布依族苗族自治县",
                  "紫云苗族布依族自治县",
                  "关岭布依族苗族自治县"
                ]
              },
              {
                "name": "铜仁地区",
                "area": [
                  "铜仁市",
                  "德江县",
                  "江口县",
                  "思南县",
                  "石阡县",
                  "玉屏侗族自治县",
                  "松桃苗族自治县",
                  "印江土家族苗族自治县",
                  "沿河土家族自治县",
                  "万山特区"
                ]
              },
              {
                "name": "毕节地区",
                "area": [
                  "毕节市",
                  "黔西县",
                  "大方县",
                  "织金县",
                  "金沙县",
                  "赫章县",
                  "纳雍县",
                  "威宁彝族回族苗族自治县"
                ]
              },
              {
                "name": "黔西南布依族苗族自治州",
                "area": [
                  "兴义市",
                  "望谟县",
                  "兴仁县",
                  "普安县",
                  "册亨县",
                  "晴隆县",
                  "贞丰县",
                  "安龙县"
                ]
              },
              {
                "name": "黔东南苗族侗族自治州",
                "area": [
                  "凯里市",
                  "施秉县",
                  "从江县",
                  "锦屏县",
                  "镇远县",
                  "麻江县",
                  "台江县",
                  "天柱县",
                  "黄平县",
                  "榕江县",
                  "剑河县",
                  "三穗县",
                  "雷山县",
                  "黎平县",
                  "岑巩县",
                  "丹寨县"
                ]
              },
              {
                "name": "黔南布依族苗族自治州",
                "area": [
                  "都匀市",
                  "福泉市",
                  "贵定县",
                  "惠水县",
                  "罗甸县",
                  "瓮安县",
                  "荔波县",
                  "龙里县",
                  "平塘县",
                  "长顺县",
                  "独山县",
                  "三都水族自治县"
                ]
              }
            ]
          },
          {
            "name": "云南省",
            "city": [
              {
                "name": "昆明市",
                "area": [
                  "盘龙区",
                  "五华区",
                  "官渡区",
                  "西山区",
                  "东川区",
                  "安宁市",
                  "呈贡县",
                  "晋宁县",
                  "富民县",
                  "宜良县",
                  "嵩明县",
                  "石林彝族自治县",
                  "禄劝彝族苗族自治县",
                  "寻甸回族彝族自治县"
                ]
              },
              {
                "name": "曲靖市",
                "area": [
                  "麒麟区",
                  "宣威市",
                  "马龙县",
                  "沾益县",
                  "富源县",
                  "罗平县",
                  "师宗县",
                  "陆良县",
                  "会泽县"
                ]
              },
              {
                "name": "玉溪市",
                "area": [
                  "红塔区",
                  "江川县",
                  "澄江县",
                  "通海县",
                  "华宁县",
                  "易门县",
                  "峨山彝族自治县",
                  "新平彝族傣族自治县",
                  "元江哈尼族彝族傣族自治县"
                ]
              },
              {
                "name": "保山市",
                "area": [
                  "隆阳区",
                  "施甸县",
                  "腾冲县",
                  "龙陵县",
                  "昌宁县"
                ]
              },
              {
                "name": "昭通市",
                "area": [
                  "昭阳区",
                  "鲁甸县",
                  "巧家县",
                  "盐津县",
                  "大关县",
                  "永善县",
                  "绥江县",
                  "镇雄县",
                  "彝良县",
                  "威信县",
                  "水富县"
                ]
              },
              {
                "name": "丽江市",
                "area": [
                  "古城区",
                  "永胜县",
                  "华坪县",
                  "玉龙纳西族自治县",
                  "宁蒗彝族自治县"
                ]
              },
              {
                "name": "普洱市",
                "area": [
                  "思茅区",
                  "普洱哈尼族彝族自治县",
                  "墨江哈尼族自治县",
                  "景东彝族自治县",
                  "景谷傣族彝族自治县",
                  "镇沅彝族哈尼族拉祜族自治县",
                  "江城哈尼族彝族自治县",
                  "孟连傣族拉祜族佤族自治县",
                  "澜沧拉祜族自治县",
                  "西盟佤族自治县"
                ]
              },
              {
                "name": "临沧市",
                "area": [
                  "临翔区",
                  "凤庆县",
                  "云县",
                  "永德县",
                  "镇康县",
                  "双江拉祜族佤族布朗族傣族自治县",
                  "耿马傣族佤族自治县",
                  "沧源佤族自治县"
                ]
              },
              {
                "name": "德宏傣族景颇族自治州",
                "area": [
                  "潞西市",
                  "瑞丽市",
                  "梁河县",
                  "盈江县",
                  "陇川县"
                ]
              },
              {
                "name": "怒江傈僳族自治州",
                "area": [
                  "泸水县",
                  "福贡县",
                  "贡山独龙族怒族自治县",
                  "兰坪白族普米族自治县"
                ]
              },
              {
                "name": "迪庆藏族自治州",
                "area": [
                  "香格里拉县",
                  "德钦县",
                  "维西傈僳族自治县"
                ]
              },
              {
                "name": "大理白族自治州",
                "area": [
                  "大理市",
                  "祥云县",
                  "宾川县",
                  "弥渡县",
                  "永平县",
                  "云龙县",
                  "洱源县",
                  "剑川县",
                  "鹤庆县",
                  "漾濞彝族自治县",
                  "南涧彝族自治县",
                  "巍山彝族回族自治县"
                ]
              },
              {
                "name": "楚雄彝族自治州",
                "area": [
                  "楚雄市",
                  "双柏县",
                  "牟定县",
                  "南华县",
                  "姚安县",
                  "大姚县",
                  "永仁县",
                  "元谋县",
                  "武定县",
                  "禄丰县"
                ]
              },
              {
                "name": "红河哈尼族彝族自治州",
                "area": [
                  "蒙自县",
                  "个旧市",
                  "开远市",
                  "绿春县",
                  "建水县",
                  "石屏县",
                  "弥勒县",
                  "泸西县",
                  "元阳县",
                  "红河县",
                  "金平苗族瑶族傣族自治县",
                  "河口瑶族自治县",
                  "屏边苗族自治县"
                ]
              },
              {
                "name": "文山壮族苗族自治州",
                "area": [
                  "文山县",
                  "砚山县",
                  "西畴县",
                  "麻栗坡县",
                  "马关县",
                  "丘北县",
                  "广南县",
                  "富宁县"
                ]
              },
              {
                "name": "西双版纳傣族自治州",
                "area": [
                  "景洪市",
                  "勐海县",
                  "勐腊县"
                ]
              }
            ]
          },
          {
            "name": "重庆市",
            "city": [
              {
                "name": "重庆市",
                "area": [
                  "渝中区",
                  "大渡口区",
                  "江北区",
                  "南岸区",
                  "北碚区",
                  "渝北区",
                  "巴南区",
                  "长寿区",
                  "双桥区",
                  "沙坪坝区",
                  "万盛区",
                  "万州区",
                  "涪陵区",
                  "黔江区",
                  "永川区",
                  "合川区",
                  "江津区",
                  "九龙坡区",
                  "南川区",
                  "綦江县",
                  "潼南县",
                  "荣昌县",
                  "璧山县",
                  "大足县",
                  "铜梁县",
                  "梁平县",
                  "开县",
                  "忠县",
                  "城口县",
                  "垫江县",
                  "武隆县",
                  "丰都县",
                  "奉节县",
                  "云阳县",
                  "巫溪县",
                  "巫山县",
                  "石柱土家族自治县",
                  "秀山土家族苗族自治县",
                  "酉阳土家族苗族自治县",
                  "彭水苗族土家族自治县"
                ]
              }
            ]
          }
        ],
        provinceChosen: '四川省',
        municipalityChosen: '成都市',
        districtChosen: '青羊区',
        province: [
          {
          "name": "四川省",
          "city": [
            {
              "name": "成都市",
              "area": [
                "青羊区",
                "锦江区",
                "金牛区",
                "武侯区",
                "成华区",
                "龙泉驿区",
                "青白江区",
                "新都区",
                "温江区",
                "都江堰市",
                "彭州市",
                "邛崃市",
                "崇州市",
                "金堂县",
                "郫县",
                "新津县",
                "双流县",
                "蒲江县",
                "大邑县"
              ]
            },
            {
              "name": "自贡市",
              "area": [
                "大安区",
                "自流井区",
                "贡井区",
                "沿滩区",
                "荣县",
                "富顺县"
              ]
            },
            {
              "name": "攀枝花市",
              "area": [
                "仁和区",
                "米易县",
                "盐边县",
                "东区",
                "西区"
              ]
            },
            {
              "name": "泸州市",
              "area": [
                "江阳区",
                "纳溪区",
                "龙马潭区",
                "泸县",
                "合江县",
                "叙永县",
                "古蔺县"
              ]
            },
            {
              "name": "德阳市",
              "area": [
                "旌阳区",
                "广汉市",
                "什邡市",
                "绵竹市",
                "罗江县",
                "中江县"
              ]
            },
            {
              "name": "绵阳市",
              "area": [
                "涪城区",
                "游仙区",
                "江油市",
                "盐亭县",
                "三台县",
                "平武县",
                "安县",
                "梓潼县",
                "北川羌族自治县"
              ]
            },
            {
              "name": "广元市",
              "area": [
                "元坝区",
                "朝天区",
                "青川县",
                "旺苍县",
                "剑阁县",
                "苍溪县",
                "市中区"
              ]
            },
            {
              "name": "遂宁市",
              "area": [
                "船山区",
                "安居区",
                "射洪县",
                "蓬溪县",
                "大英县"
              ]
            },
            {
              "name": "内江市",
              "area": [
                "市中区",
                "东兴区",
                "资中县",
                "隆昌县",
                "威远县"
              ]
            },
            {
              "name": "乐山市",
              "area": [
                "市中区",
                "五通桥区",
                "沙湾区",
                "金口河区",
                "峨眉山市",
                "夹江县",
                "井研县",
                "犍为县",
                "沐川县",
                "马边彝族自治县",
                "峨边彝族自治县"
              ]
            },
            {
              "name": "南充",
              "area": [
                "顺庆区",
                "高坪区",
                "嘉陵区",
                "阆中市",
                "营山县",
                "蓬安县",
                "仪陇县",
                "南部县",
                "西充县"
              ]
            },
            {
              "name": "眉山市",
              "area": [
                "东坡区",
                "仁寿县",
                "彭山县",
                "洪雅县",
                "丹棱县",
                "青神县"
              ]
            },
            {
              "name": "宜宾市",
              "area": [
                "翠屏区",
                "宜宾县",
                "兴文县",
                "南溪县",
                "珙县",
                "长宁县",
                "高县",
                "江安县",
                "筠连县",
                "屏山县"
              ]
            },
            {
              "name": "广安市",
              "area": [
                "广安区",
                "华蓥市",
                "岳池县",
                "邻水县",
                "武胜县"
              ]
            },
            {
              "name": "达州市",
              "area": [
                "通川区",
                "万源市",
                "达县",
                "渠县",
                "宣汉县",
                "开江县",
                "大竹县"
              ]
            },
            {
              "name": "雅安市",
              "area": [
                "雨城区",
                "芦山县",
                "石棉县",
                "名山县",
                "天全县",
                "荥经县",
                "宝兴县",
                "汉源县"
              ]
            },
            {
              "name": "巴中市",
              "area": [
                "巴州区",
                "南江县",
                "平昌县",
                "通江县"
              ]
            },
            {
              "name": "资阳市",
              "area": [
                "雁江区",
                "简阳市",
                "安岳县",
                "乐至县"
              ]
            },
            {
              "name": "阿坝藏族羌族自治州",
              "area": [
                "马尔康县",
                "九寨沟县",
                "红原县",
                "汶川县",
                "阿坝县",
                "理县",
                "若尔盖县",
                "小金县",
                "黑水县",
                "金川县",
                "松潘县",
                "壤塘县",
                "茂县"
              ]
            },
            {
              "name": "甘孜藏族自治州",
              "area": [
                "康定县",
                "丹巴县",
                "炉霍县",
                "九龙县",
                "甘孜县",
                "雅江县",
                "新龙县",
                "道孚县",
                "白玉县",
                "理塘县",
                "德格县",
                "乡城县",
                "石渠县",
                "稻城县",
                "色达县",
                "巴塘县",
                "泸定县",
                "得荣县"
              ]
            },
            {
              "name": "凉山彝族自治州",
              "area": [
                "西昌市",
                "美姑县",
                "昭觉县",
                "金阳县",
                "甘洛县",
                "布拖县",
                "雷波县",
                "普格县",
                "宁南县",
                "喜德县",
                "会东县",
                "越西县",
                "会理县",
                "盐源县",
                "德昌县",
                "冕宁县",
                "木里藏族自治县"
              ]
            }
          ]
        },
          {
            "name": "浙江省",
            "city": [
              {
                "name": "杭州市",
                "area": [
                  "拱墅区",
                  "西湖区",
                  "上城区",
                  "下城区",
                  "江干区",
                  "滨江区",
                  "余杭区",
                  "萧山区",
                  "建德市",
                  "富阳市",
                  "临安市",
                  "桐庐县",
                  "淳安县"
                ]
              },
              {
                "name": "宁波市",
                "area": [
                  "海曙区",
                  "江东区",
                  "江北区",
                  "镇海区",
                  "北仑区",
                  "鄞州区",
                  "余姚市",
                  "慈溪市",
                  "奉化市",
                  "宁海县",
                  "象山县"
                ]
              },
              {
                "name": "温州市",
                "area": [
                  "鹿城区",
                  "龙湾区",
                  "瓯海区",
                  "瑞安市",
                  "乐清市",
                  "永嘉县",
                  "洞头县",
                  "平阳县",
                  "苍南县",
                  "文成县",
                  "泰顺县"
                ]
              },
              {
                "name": "嘉兴市",
                "area": [
                  "秀城区",
                  "秀洲区",
                  "海宁市",
                  "平湖市",
                  "桐乡市",
                  "嘉善县",
                  "海盐县"
                ]
              },
              {
                "name": "湖州市",
                "area": [
                  "吴兴区",
                  "南浔区",
                  "长兴县",
                  "德清县",
                  "安吉县"
                ]
              },
              {
                "name": "绍兴市",
                "area": [
                  "越城区",
                  "诸暨市",
                  "上虞市",
                  "嵊州市",
                  "绍兴县",
                  "新昌县"
                ]
              },
              {
                "name": "金华市",
                "area": [
                  "婺城区",
                  "金东区",
                  "兰溪市",
                  "义乌市",
                  "东阳市",
                  "永康市",
                  "武义县",
                  "浦江县",
                  "磐安县"
                ]
              },
              {
                "name": "衢州市",
                "area": [
                  "柯城区",
                  "衢江区",
                  "江山市",
                  "龙游县",
                  "常山县",
                  "开化县"
                ]
              },
              {
                "name": "舟山市",
                "area": [
                  "定海区",
                  "普陀区",
                  "岱山县",
                  "嵊泗县"
                ]
              },
              {
                "name": "台州市",
                "area": [
                  "椒江区",
                  "黄岩区",
                  "路桥区",
                  "临海市",
                  "温岭市",
                  "玉环县",
                  "天台县",
                  "仙居县",
                  "三门县"
                ]
              },
              {
                "name": "丽水市",
                "area": [
                  "莲都区",
                  "龙泉市",
                  "缙云县",
                  "青田县",
                  "云和县",
                  "遂昌县",
                  "松阳县",
                  "庆元县",
                  "景宁畲族自治县"
                ]
              }
            ]
          },
          {
            "name": "福建省",
            "city": [
              {
                "name": "福州市",
                "area": [
                  "鼓楼区",
                  "台江区",
                  "仓山区",
                  "马尾区",
                  "晋安区",
                  "福清市",
                  "长乐市",
                  "闽侯县",
                  "闽清县",
                  "永泰县",
                  "连江县",
                  "罗源县",
                  "平潭县"
                ]
              },
              {
                "name": "厦门市",
                "area": [
                  "思明区",
                  "海沧区",
                  "湖里区",
                  "集美区",
                  "同安区",
                  "翔安区"
                ]
              },
              {
                "name": "莆田市",
                "area": [
                  "城厢区",
                  "涵江区",
                  "荔城区",
                  "秀屿区",
                  "仙游县"
                ]
              },
              {
                "name": "三明市",
                "area": [
                  "梅列区",
                  "三元区",
                  "永安市",
                  "明溪县",
                  "将乐县",
                  "大田县",
                  "宁化县",
                  "建宁县",
                  "沙县",
                  "尤溪县",
                  "清流县",
                  "泰宁县"
                ]
              },
              {
                "name": "泉州市",
                "area": [
                  "鲤城区",
                  "丰泽区",
                  "洛江区",
                  "泉港区",
                  "石狮市",
                  "晋江市",
                  "南安市",
                  "惠安县",
                  "永春县",
                  "安溪县",
                  "德化县",
                  "金门县"
                ]
              },
              {
                "name": "漳州市",
                "area": [
                  "芗城区",
                  "龙文区",
                  "龙海市",
                  "平和县",
                  "南靖县",
                  "诏安县",
                  "漳浦县",
                  "华安县",
                  "东山县",
                  "长泰县",
                  "云霄县"
                ]
              },
              {
                "name": "南平市",
                "area": [
                  "延平区",
                  "建瓯市",
                  "邵武市",
                  "武夷山市",
                  "建阳市",
                  "松溪县",
                  "光泽县",
                  "顺昌县",
                  "浦城县",
                  "政和县"
                ]
              },
              {
                "name": "龙岩市",
                "area": [
                  "新罗区",
                  "漳平市",
                  "长汀县",
                  "武平县",
                  "上杭县",
                  "永定县",
                  "连城县"
                ]
              },
              {
                "name": "宁德市",
                "area": [
                  "蕉城区",
                  "福安市",
                  "福鼎市",
                  "寿宁县",
                  "霞浦县",
                  "柘荣县",
                  "屏南县",
                  "古田县",
                  "周宁县"
                ]
              }
            ]
          },
          {
            "name": "广东省",
            "city": [
              {
                "name": "广州市",
                "area": [
                  "越秀区",
                  "荔湾区",
                  "海珠区",
                  "天河区",
                  "白云区",
                  "黄埔区",
                  "番禺区",
                  "花都区",
                  "南沙区",
                  "萝岗区",
                  "增城市",
                  "从化市"
                ]
              },
              {
                "name": "深圳市",
                "area": [
                  "福田区",
                  "罗湖区",
                  "南山区",
                  "宝安区",
                  "龙岗区",
                  "盐田区"
                ]
              },
              {
                "name": "东莞市",
                "area": [
                  "莞城",
                  "常平",
                  "塘厦",
                  "塘厦",
                  "塘厦"
                ]
              },
              {
                "name": "中山市",
                "area": [
                  "中山"
                ]
              },
              {
                "name": "潮州市",
                "area": [
                  "湘桥区",
                  "潮安县",
                  "饶平县"
                ]
              },
              {
                "name": "揭阳市",
                "area": [
                  "榕城区",
                  "揭东县",
                  "揭西县",
                  "惠来县",
                  "普宁市"
                ]
              },
              {
                "name": "云浮市",
                "area": [
                  "云城区",
                  "新兴县",
                  "郁南县",
                  "云安县",
                  "罗定市"
                ]
              },
              {
                "name": "珠海市",
                "area": [
                  "香洲区",
                  "斗门区",
                  "金湾区"
                ]
              },
              {
                "name": "汕头市",
                "area": [
                  "金平区",
                  "濠江区",
                  "龙湖区",
                  "潮阳区",
                  "潮南区",
                  "澄海区",
                  "南澳县"
                ]
              },
              {
                "name": "韶关市",
                "area": [
                  "浈江区",
                  "武江区",
                  "曲江区",
                  "乐昌市",
                  "南雄市",
                  "始兴县",
                  "仁化县",
                  "翁源县",
                  "新丰县",
                  "乳源瑶族自治县"
                ]
              },
              {
                "name": "佛山市",
                "area": [
                  "禅城区",
                  "南海区",
                  "顺德区",
                  "三水区",
                  "高明区"
                ]
              },
              {
                "name": "江门市",
                "area": [
                  "蓬江区",
                  "江海区",
                  "新会区",
                  "恩平市",
                  "台山市",
                  "开平市",
                  "鹤山市"
                ]
              },
              {
                "name": "湛江市",
                "area": [
                  "赤坎区",
                  "霞山区",
                  "坡头区",
                  "麻章区",
                  "吴川市",
                  "廉江市",
                  "雷州市",
                  "遂溪县",
                  "徐闻县"
                ]
              },
              {
                "name": "茂名市",
                "area": [
                  "茂南区",
                  "茂港区",
                  "化州市",
                  "信宜市",
                  "高州市",
                  "电白县"
                ]
              },
              {
                "name": "肇庆市",
                "area": [
                  "端州区",
                  "鼎湖区",
                  "高要市",
                  "四会市",
                  "广宁县",
                  "怀集县",
                  "封开县",
                  "德庆县"
                ]
              },
              {
                "name": "惠州市",
                "area": [
                  "惠城区",
                  "惠阳区",
                  "博罗县",
                  "惠东县",
                  "龙门县"
                ]
              },
              {
                "name": "梅州市",
                "area": [
                  "梅江区",
                  "兴宁市",
                  "梅县",
                  "大埔县",
                  "丰顺县",
                  "五华县",
                  "平远县",
                  "蕉岭县"
                ]
              },
              {
                "name": "汕尾市",
                "area": [
                  "城区",
                  "陆丰市",
                  "海丰县",
                  "陆河县"
                ]
              },
              {
                "name": "河源市",
                "area": [
                  "源城区",
                  "紫金县",
                  "龙川县",
                  "连平县",
                  "和平县",
                  "东源县"
                ]
              },
              {
                "name": "阳江市",
                "area": [
                  "江城区",
                  "阳春市",
                  "阳西县",
                  "阳东县"
                ]
              },
              {
                "name": "清远市",
                "area": [
                  "清城区",
                  "英德市",
                  "连州市",
                  "佛冈县",
                  "阳山县",
                  "清新县",
                  "连山壮族瑶族自治县",
                  "连南瑶族自治县"
                ]
              }
            ]
          },
          {
            "name": "贵州省",
            "city": [
              {
                "name": "贵阳市",
                "area": [
                  "南明区",
                  "云岩区",
                  "花溪区",
                  "乌当区",
                  "白云区",
                  "小河区",
                  "清镇市",
                  "开阳县",
                  "修文县",
                  "息烽县"
                ]
              },
              {
                "name": "六盘水市",
                "area": [
                  "钟山区",
                  "水城县",
                  "盘县",
                  "六枝特区"
                ]
              },
              {
                "name": "遵义市",
                "area": [
                  "红花岗区",
                  "汇川区",
                  "赤水市",
                  "仁怀市",
                  "遵义县",
                  "绥阳县",
                  "桐梓县",
                  "习水县",
                  "凤冈县",
                  "正安县",
                  "余庆县",
                  "湄潭县",
                  "道真仡佬族苗族自治县",
                  "务川仡佬族苗族自治县"
                ]
              },
              {
                "name": "安顺市",
                "area": [
                  "西秀区",
                  "普定县",
                  "平坝县",
                  "镇宁布依族苗族自治县",
                  "紫云苗族布依族自治县",
                  "关岭布依族苗族自治县"
                ]
              },
              {
                "name": "铜仁地区",
                "area": [
                  "铜仁市",
                  "德江县",
                  "江口县",
                  "思南县",
                  "石阡县",
                  "玉屏侗族自治县",
                  "松桃苗族自治县",
                  "印江土家族苗族自治县",
                  "沿河土家族自治县",
                  "万山特区"
                ]
              },
              {
                "name": "毕节地区",
                "area": [
                  "毕节市",
                  "黔西县",
                  "大方县",
                  "织金县",
                  "金沙县",
                  "赫章县",
                  "纳雍县",
                  "威宁彝族回族苗族自治县"
                ]
              },
              {
                "name": "黔西南布依族苗族自治州",
                "area": [
                  "兴义市",
                  "望谟县",
                  "兴仁县",
                  "普安县",
                  "册亨县",
                  "晴隆县",
                  "贞丰县",
                  "安龙县"
                ]
              },
              {
                "name": "黔东南苗族侗族自治州",
                "area": [
                  "凯里市",
                  "施秉县",
                  "从江县",
                  "锦屏县",
                  "镇远县",
                  "麻江县",
                  "台江县",
                  "天柱县",
                  "黄平县",
                  "榕江县",
                  "剑河县",
                  "三穗县",
                  "雷山县",
                  "黎平县",
                  "岑巩县",
                  "丹寨县"
                ]
              },
              {
                "name": "黔南布依族苗族自治州",
                "area": [
                  "都匀市",
                  "福泉市",
                  "贵定县",
                  "惠水县",
                  "罗甸县",
                  "瓮安县",
                  "荔波县",
                  "龙里县",
                  "平塘县",
                  "长顺县",
                  "独山县",
                  "三都水族自治县"
                ]
              }
            ]
          },
          {
            "name": "云南省",
            "city": [
              {
                "name": "昆明市",
                "area": [
                  "盘龙区",
                  "五华区",
                  "官渡区",
                  "西山区",
                  "东川区",
                  "安宁市",
                  "呈贡县",
                  "晋宁县",
                  "富民县",
                  "宜良县",
                  "嵩明县",
                  "石林彝族自治县",
                  "禄劝彝族苗族自治县",
                  "寻甸回族彝族自治县"
                ]
              },
              {
                "name": "曲靖市",
                "area": [
                  "麒麟区",
                  "宣威市",
                  "马龙县",
                  "沾益县",
                  "富源县",
                  "罗平县",
                  "师宗县",
                  "陆良县",
                  "会泽县"
                ]
              },
              {
                "name": "玉溪市",
                "area": [
                  "红塔区",
                  "江川县",
                  "澄江县",
                  "通海县",
                  "华宁县",
                  "易门县",
                  "峨山彝族自治县",
                  "新平彝族傣族自治县",
                  "元江哈尼族彝族傣族自治县"
                ]
              },
              {
                "name": "保山市",
                "area": [
                  "隆阳区",
                  "施甸县",
                  "腾冲县",
                  "龙陵县",
                  "昌宁县"
                ]
              },
              {
                "name": "昭通市",
                "area": [
                  "昭阳区",
                  "鲁甸县",
                  "巧家县",
                  "盐津县",
                  "大关县",
                  "永善县",
                  "绥江县",
                  "镇雄县",
                  "彝良县",
                  "威信县",
                  "水富县"
                ]
              },
              {
                "name": "丽江市",
                "area": [
                  "古城区",
                  "永胜县",
                  "华坪县",
                  "玉龙纳西族自治县",
                  "宁蒗彝族自治县"
                ]
              },
              {
                "name": "普洱市",
                "area": [
                  "思茅区",
                  "普洱哈尼族彝族自治县",
                  "墨江哈尼族自治县",
                  "景东彝族自治县",
                  "景谷傣族彝族自治县",
                  "镇沅彝族哈尼族拉祜族自治县",
                  "江城哈尼族彝族自治县",
                  "孟连傣族拉祜族佤族自治县",
                  "澜沧拉祜族自治县",
                  "西盟佤族自治县"
                ]
              },
              {
                "name": "临沧市",
                "area": [
                  "临翔区",
                  "凤庆县",
                  "云县",
                  "永德县",
                  "镇康县",
                  "双江拉祜族佤族布朗族傣族自治县",
                  "耿马傣族佤族自治县",
                  "沧源佤族自治县"
                ]
              },
              {
                "name": "德宏傣族景颇族自治州",
                "area": [
                  "潞西市",
                  "瑞丽市",
                  "梁河县",
                  "盈江县",
                  "陇川县"
                ]
              },
              {
                "name": "怒江傈僳族自治州",
                "area": [
                  "泸水县",
                  "福贡县",
                  "贡山独龙族怒族自治县",
                  "兰坪白族普米族自治县"
                ]
              },
              {
                "name": "迪庆藏族自治州",
                "area": [
                  "香格里拉县",
                  "德钦县",
                  "维西傈僳族自治县"
                ]
              },
              {
                "name": "大理白族自治州",
                "area": [
                  "大理市",
                  "祥云县",
                  "宾川县",
                  "弥渡县",
                  "永平县",
                  "云龙县",
                  "洱源县",
                  "剑川县",
                  "鹤庆县",
                  "漾濞彝族自治县",
                  "南涧彝族自治县",
                  "巍山彝族回族自治县"
                ]
              },
              {
                "name": "楚雄彝族自治州",
                "area": [
                  "楚雄市",
                  "双柏县",
                  "牟定县",
                  "南华县",
                  "姚安县",
                  "大姚县",
                  "永仁县",
                  "元谋县",
                  "武定县",
                  "禄丰县"
                ]
              },
              {
                "name": "红河哈尼族彝族自治州",
                "area": [
                  "蒙自县",
                  "个旧市",
                  "开远市",
                  "绿春县",
                  "建水县",
                  "石屏县",
                  "弥勒县",
                  "泸西县",
                  "元阳县",
                  "红河县",
                  "金平苗族瑶族傣族自治县",
                  "河口瑶族自治县",
                  "屏边苗族自治县"
                ]
              },
              {
                "name": "文山壮族苗族自治州",
                "area": [
                  "文山县",
                  "砚山县",
                  "西畴县",
                  "麻栗坡县",
                  "马关县",
                  "丘北县",
                  "广南县",
                  "富宁县"
                ]
              },
              {
                "name": "西双版纳傣族自治州",
                "area": [
                  "景洪市",
                  "勐海县",
                  "勐腊县"
                ]
              }
            ]
          },
          {
            "name": "重庆市",
            "city": [
              {
                "name": "重庆市",
                "area": [
                  "渝中区",
                  "大渡口区",
                  "江北区",
                  "南岸区",
                  "北碚区",
                  "渝北区",
                  "巴南区",
                  "长寿区",
                  "双桥区",
                  "沙坪坝区",
                  "万盛区",
                  "万州区",
                  "涪陵区",
                  "黔江区",
                  "永川区",
                  "合川区",
                  "江津区",
                  "九龙坡区",
                  "南川区",
                  "綦江县",
                  "潼南县",
                  "荣昌县",
                  "璧山县",
                  "大足县",
                  "铜梁县",
                  "梁平县",
                  "开县",
                  "忠县",
                  "城口县",
                  "垫江县",
                  "武隆县",
                  "丰都县",
                  "奉节县",
                  "云阳县",
                  "巫溪县",
                  "巫山县",
                  "石柱土家族自治县",
                  "秀山土家族苗族自治县",
                  "酉阳土家族苗族自治县",
                  "彭水苗族土家族自治县"
                ]
              }
            ]
          }
        ],
        municipality: [
          {
            "name": "成都市",
            "area": [
              "青羊区",
              "锦江区",
              "金牛区",
              "武侯区",
              "成华区",
              "龙泉驿区",
              "青白江区",
              "新都区",
              "温江区",
              "都江堰市",
              "彭州市",
              "邛崃市",
              "崇州市",
              "金堂县",
              "郫县",
              "新津县",
              "双流县",
              "蒲江县",
              "大邑县"
            ]
          },
          {
            "name": "自贡市",
            "area": [
              "大安区",
              "自流井区",
              "贡井区",
              "沿滩区",
              "荣县",
              "富顺县"
            ]
          },
          {
            "name": "攀枝花市",
            "area": [
              "仁和区",
              "米易县",
              "盐边县",
              "东区",
              "西区"
            ]
          },
          {
            "name": "泸州市",
            "area": [
              "江阳区",
              "纳溪区",
              "龙马潭区",
              "泸县",
              "合江县",
              "叙永县",
              "古蔺县"
            ]
          },
          {
            "name": "德阳市",
            "area": [
              "旌阳区",
              "广汉市",
              "什邡市",
              "绵竹市",
              "罗江县",
              "中江县"
            ]
          },
          {
            "name": "绵阳市",
            "area": [
              "涪城区",
              "游仙区",
              "江油市",
              "盐亭县",
              "三台县",
              "平武县",
              "安县",
              "梓潼县",
              "北川羌族自治县"
            ]
          },
          {
            "name": "广元市",
            "area": [
              "元坝区",
              "朝天区",
              "青川县",
              "旺苍县",
              "剑阁县",
              "苍溪县",
              "市中区"
            ]
          },
          {
            "name": "遂宁市",
            "area": [
              "船山区",
              "安居区",
              "射洪县",
              "蓬溪县",
              "大英县"
            ]
          },
          {
            "name": "内江市",
            "area": [
              "市中区",
              "东兴区",
              "资中县",
              "隆昌县",
              "威远县"
            ]
          },
          {
            "name": "乐山市",
            "area": [
              "市中区",
              "五通桥区",
              "沙湾区",
              "金口河区",
              "峨眉山市",
              "夹江县",
              "井研县",
              "犍为县",
              "沐川县",
              "马边彝族自治县",
              "峨边彝族自治县"
            ]
          },
          {
            "name": "南充",
            "area": [
              "顺庆区",
              "高坪区",
              "嘉陵区",
              "阆中市",
              "营山县",
              "蓬安县",
              "仪陇县",
              "南部县",
              "西充县"
            ]
          },
          {
            "name": "眉山市",
            "area": [
              "东坡区",
              "仁寿县",
              "彭山县",
              "洪雅县",
              "丹棱县",
              "青神县"
            ]
          },
          {
            "name": "宜宾市",
            "area": [
              "翠屏区",
              "宜宾县",
              "兴文县",
              "南溪县",
              "珙县",
              "长宁县",
              "高县",
              "江安县",
              "筠连县",
              "屏山县"
            ]
          },
          {
            "name": "广安市",
            "area": [
              "广安区",
              "华蓥市",
              "岳池县",
              "邻水县",
              "武胜县"
            ]
          },
          {
            "name": "达州市",
            "area": [
              "通川区",
              "万源市",
              "达县",
              "渠县",
              "宣汉县",
              "开江县",
              "大竹县"
            ]
          },
          {
            "name": "雅安市",
            "area": [
              "雨城区",
              "芦山县",
              "石棉县",
              "名山县",
              "天全县",
              "荥经县",
              "宝兴县",
              "汉源县"
            ]
          },
          {
            "name": "巴中市",
            "area": [
              "巴州区",
              "南江县",
              "平昌县",
              "通江县"
            ]
          },
          {
            "name": "资阳市",
            "area": [
              "雁江区",
              "简阳市",
              "安岳县",
              "乐至县"
            ]
          },
          {
            "name": "阿坝藏族羌族自治州",
            "area": [
              "马尔康县",
              "九寨沟县",
              "红原县",
              "汶川县",
              "阿坝县",
              "理县",
              "若尔盖县",
              "小金县",
              "黑水县",
              "金川县",
              "松潘县",
              "壤塘县",
              "茂县"
            ]
          },
          {
            "name": "甘孜藏族自治州",
            "area": [
              "康定县",
              "丹巴县",
              "炉霍县",
              "九龙县",
              "甘孜县",
              "雅江县",
              "新龙县",
              "道孚县",
              "白玉县",
              "理塘县",
              "德格县",
              "乡城县",
              "石渠县",
              "稻城县",
              "色达县",
              "巴塘县",
              "泸定县",
              "得荣县"
            ]
          },
          {
            "name": "凉山彝族自治州",
            "area": [
              "西昌市",
              "美姑县",
              "昭觉县",
              "金阳县",
              "甘洛县",
              "布拖县",
              "雷波县",
              "普格县",
              "宁南县",
              "喜德县",
              "会东县",
              "越西县",
              "会理县",
              "盐源县",
              "德昌县",
              "冕宁县",
              "木里藏族自治县"
            ]
          }
        ],
        district: [
          "青羊区",
          "锦江区",
          "金牛区",
          "武侯区",
          "成华区",
          "龙泉驿区",
          "青白江区",
          "新都区",
          "温江区",
          "都江堰市",
          "彭州市",
          "邛崃市",
          "崇州市",
          "金堂县",
          "郫县",
          "新津县",
          "双流县",
          "蒲江县",
          "大邑县"
        ],
        moveProvinceLastY: 0,
        moveMunicipalityLastY: 0,
        moveDistrictLastY: 0,
        basicProvinceLastY: 30,
        basicMunicipalityLastY: 30,
        basicDistrictLastY: 30,
      }
    },
    activated(){
      this.setInfo();
    },
    methods: {
      setInfo () {
        this.province = [];
        this.municipality = [];
        this.province = this.cities;
        this.municipality = this.cities[0].city;
        this.district = this.cities[0].city[0].area;
      },
      initProvinceY (e) {
        this.moveProvinceLastY = e.changedTouches[0].pageY;
      },
      choseProvince (e) {
        let target = e.target || e.srcElement;
        target = target.parentNode;
        let maxTop = 40 - Math.round((target.offsetHeight/window.screen.width)*100);
        let moveY = this.moveProvinceLastY - e.changedTouches[0].pageY;
        this.moveProvinceLastY = e.changedTouches[0].pageY;
        this.basicProvinceLastY = this.basicProvinceLastY - ((moveY / 750) *200);
        if (this.basicProvinceLastY > 30 ) {
          this.basicProvinceLastY = 30;
        }
        if (this.basicProvinceLastY <= maxTop) {
          this.basicProvinceLastY = maxTop;
        }
        target.style.marginTop = this.basicProvinceLastY + 'vw';
        this.provinceChosen = this.province[Math.round((30 - this.basicProvinceLastY) / 10)].name;
        this.municipality = this.province[Math.round((30 - this.basicProvinceLastY) / 10)].city;
        this.municipalityChosen = this.municipality[0].name;
        this.moveMunicipalityLastY = 30;
        document.getElementsByClassName('col-8')[1].style.marginTop = '30vw';
        this.district = this.municipality[0].area;
        this.districtChosen = this.district[0];
        this.basicDistrictLastY = 30;
        document.getElementsByClassName('col-8')[2].style.marginTop = '30vw';
      },
      confirmProvince (e) {
        let target = e.target || e.srcElement;
        target = target.parentNode;
        this.basicProvinceLastY = 30 - Math.round((30 - this.basicProvinceLastY)/10)*10;
        target.style.marginTop = this.basicProvinceLastY + 'vw';
      },
      initMunicipalityY (e) {
        this.moveMunicipalityLastY = e.changedTouches[0].pageY;
      },
      choseMunicipality (e) {
        let target = e.target || e.srcElement;
        target = target.parentNode;
        let maxTop = 40 - Math.round((target.offsetHeight/window.screen.width)*100);
        let moveY = this.moveMunicipalityLastY - e.changedTouches[0].pageY;
        this.moveMunicipalityLastY = e.changedTouches[0].pageY;
        this.basicMunicipalityLastY = this.basicMunicipalityLastY - ((moveY / 750) *200);
        if (this.basicMunicipalityLastY > 30 ) {
          this.basicMunicipalityLastY = 30;
        }
        if (this.basicMunicipalityLastY <= maxTop) {
          this.basicMunicipalityLastY = maxTop;
        }
        target.style.marginTop = this.basicMunicipalityLastY + 'vw';
        this.municipalityChosen = this.municipality[Math.round((30 - this.basicMunicipalityLastY) / 10)].name;
        this.district = this.municipality[Math.round((30 - this.basicMunicipalityLastY) / 10)].area;
        this.districtChosen = this.district[0];
        this.basicDistrictLastY = 30;
        document.getElementsByClassName('col-8')[2].style.marginTop = '30vw';
      },
      confirmMunicipality (e) {
        let target = e.target || e.srcElement;
        target = target.parentNode;
        this.basicMunicipalityLastY = 30 - Math.round((30 - this.basicMunicipalityLastY)/10)*10;
        target.style.marginTop = this.basicMunicipalityLastY + 'vw';
      },
      initDistrictY (e) {
        this.moveDistrictLastY = e.changedTouches[0].pageY;
      },
      choseDistrict (e) {
        let target = e.target || e.srcElement;
        target = target.parentNode;
        let maxTop = 40 - Math.round((target.offsetHeight/window.screen.width)*100);
        let moveY = this.moveDistrictLastY - e.changedTouches[0].pageY;
        this.moveDistrictLastY = e.changedTouches[0].pageY;
        this.basicDistrictLastY = this.basicDistrictLastY - ((moveY / 750) *200);
        if (this.basicDistrictLastY > 30 ) {
          this.basicDistrictLastY = 30;
        }
        if (this.basicDistrictLastY <= maxTop) {
          this.basicDistrictLastY = maxTop;
        }
        target.style.marginTop = this.basicDistrictLastY + 'vw';
        this.districtChosen = this.district[Math.round((30 - this.basicDistrictLastY) / 10)];
      },
      confirmDistrict (e) {
        let target = e.target || e.srcElement;
        target = target.parentNode;
        this.basicDistrictLastY = 30 - Math.round((30 - this.basicDistrictLastY)/10)*10;
        target.style.marginTop = this.basicDistrictLastY + 'vw';
      },
      buttonConfirm () {
        let region = [this.provinceChosen, this.municipalityChosen, this.districtChosen];
        this.$emit("touchAddressButton", region);
      },
      buttonCancel () {
        this.$emit("touchAddressButton", false);
      }
    }
  }
</script>

<style scoped lang="scss">
  @function vm($px) {
    @return ($px / 750) * 100vw;
  }

  div.mask{
    width: 100vw;
    height: 100vh;
    position: fixed;
    top: 0;
    left: 0;
    bottom: 0;
    right: 0;
    background-color: rgba(0, 0, 0, .5);
    z-index: 1000;
  }
  div.mask>div.button-box{
    position: absolute;
    width: 100vw;
    height: 10vw;
    background-color: #ffffff;
    bottom: 70vw;
    border-bottom: vm(1) #e2e2e2 solid;
  }
  div.mask>div.button-box>button{
    width: 20vw;
    height: 10vw;
    border: none;
    color: #333333;
  }
  div.mask>div.button-box>button:last-child{
    color: #16A9F6;
  }
  div.mask div.sign{
    position: absolute;
    bottom: 30vw;
    width: 100vw;
    height: 10vw;
    border-top: vm(1) #e2e2e2 solid;
    border-bottom: vm(1) #e2e2e2 solid;
    /*z-index: 1005;*/
    background-color: #ffffff;
  }
  div.mask>div.shade{
    position: absolute;
    width: 100vw;
    height: 70vw;
    bottom: 0;
    background-image: linear-gradient(to bottom,rgba(255, 255, 255, .8)  0%, rgba(255, 255, 255, 0) 35%, rgba(255, 255, 255, 0) 65%, rgba(255, 255, 255, .8) 100%);
    z-index: 1005;
  }
  div.mask>div.shade-bottom{
    position: absolute;
    width: 100vw;
    height: 15vw;
    bottom: 0;
    background-image: linear-gradient(to bottom,rgba(255, 255, 255, 0) 0%, rgba(255, 255, 255, .8) 100%);
    z-index: 1005;
  }
  div.mask>div.shade-top{
    position: absolute;
    width: 100vw;
    height: 15vw;
    bottom: 55vw;
    background-image: linear-gradient(to bottom,rgba(255, 255, 255, .8) 0%, rgba(255, 255, 255, 0) 100%);
    z-index: 1005;
  }
  div.mask>div.row{
    position: absolute;
    width: 100vw;
    height: 70vw;
    bottom: 0;
    background-color: #ffffff;
    overflow: hidden;
  }
  div.mask>div.row>ul{
    position: relative;
    margin-top: 30vw;
    transition: margin-top .3s;
    z-index: 1004;
  }
  div.mask>div.row li{
    height: 10vw;
    line-height: 10vw;
    text-align: center;
    color: #cccccc;
  }
  div.mask>div.row li.chosen{
    color: #333333;
  }
</style>
